# %% [markdown]
# <h1 align="center">แบบฝึกหัด List, Tuple, Dictionary และ Set</h1>
# <hr>

# %%
# 1. สร้าง List ที่มีชื่อว่า "FoodMenu" ที่มีรายการอาหารดังต่อไปนี้
# ["ต้มยำกุ้ง", "แกงส้ม", "ต้มข่าไก่", "ขนมจีนน้ำยา", "แกงเขียวหวานไก่", "มัสมั่นไก่", "แพนงหมู", "แกงจืดหมูสับ"]
FoodMenu = ["ต้มยำกุ้ง","แกงส้ม","ต้มข่าไก่","ขนมจีนน้ำยา","แกงเขียวหวานไก่","มัสมั่นไก่","แพนงหมู", "แกงจืดหมูสับ",]

# %%
# 2. เขียนโปรแกรมรับชื่ออาหารที่ต้องการค้นหาว่า -ชื่ออาหารนั้นหรือไม่
#    - ถ้ามีข้อความ ให้แสดงว่า "Lucky!!! You found your choice."
#    - ถ้าไม่มีข้อความ ให้แสดงว่า "Sorry, you miss your choice. "
food = input("ชื่ออาหารที่ต้องการค้นหา : ")
print("Lucky!!! You found your choice." if food in FoodMenu else "Sorry, you miss your choice. ")

# %%
# 3. เขียนโปรแกรมเพิ่มรายการอาหารเพิ่มเติมได้โดยการรับชื่ออาหารที่เพิ่มใหม่ พร้อมแสดงจำนวนและรายการอาหารที่มีทั้งหมด
newFood = input("เพิ่มรายการอาหารใหม่ 1 อย่าง : ")
FoodMenu.append(newFood)
print(f"จำนวนรายการอาหารที่มีทั้งหมดมีอยู่ {len(FoodMenu)} จำนวน")
print("รายการอาหารทั้งหมดได้แก่:", " , ".join(FoodMenu))
# ? หรือ
# for i in FoodMenu:
#     print(f'- {i}')

# %%
# 4. เขียนโปรแกรมลบรายการอาหารที่ต้องการลบ โดยให้แสดงรายการอาหารก่อน แล้วให้เลือกหมายเลขรายการอาหารที่ต้องการลบ พร้อมแสดงรายการอาหารที่ลบแล้ว
for i in range(len(FoodMenu)):
    print(f"{i}. {FoodMenu[i]}")
delete = input("โปรดเลือกหมายเลขรายการเพื่อทำการลบอาหาร : ")
del FoodMenu[int(delete)]
print(f"รายการอาหารใหม่ที่ทำการลบแล้ว:", *FoodMenu)

# %%
# 5. เขียนโปรแกรมแก้ไขรายการอาหาร โดยกำหนดหมายเลขลำดับอาหาร แล้วกรอกชื่ออาหารที่ต้องการแก้ไข พร้อมแสดงรายการอาหารที่แก้ไขแล้ว
idx = int(input(f"เลือกหมายเลขอาหารตั้งแต่ 0 ถึง {len(FoodMenu) - 1}"))
val = input("แก้ไขชื่ออาหาร : ")
FoodMenu[idx] = val
print(FoodMenu)

# %%
# 6. สร้าง Tuple ที่มีชื่อว่า “Faculty” ที่มีรายการคณะในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตศรีราชา ดังต่อไปนี
# ("Management", "Engineering", "Science", "Marine", "Economic")
Faculty = ("Management", "Engineering", "Science", "Marine", "Economic")

# %%
# 7. เขียนโปรแกรมแสดงรายการคณะจากหมายเลขลำดับที่เป็นช่วง โดยกำหนดค่าตำแหน่งเริ่มต้น และตำแหน่งสิ้นสุดที่ต้องการ

start = int(input('ตำแหน่งเริ่มต้น : '))
stop = int(input('ตำแหน่งสุดท้าย : '))
if start in range(Faculty.__len__()) and stop in range(Faculty.__len__()) and start != stop:
    for i in range(start , stop + 1):
        print(Faculty[i])
else: print(f'โปรดใส่ตัวเลขที่อยู่ระหว่าง 0 ถึง {len(Faculty) - 1}')

# %%
# 8. เขียนโปรแกรมค้นหาชื่อคณะที่ต้องการว่า ชื่อคณะนั้นหรือไม่
#    - ถ้ามีคณะนั้น ให้แสดงว่า "You are studying at KU Sriracha campus."
#   -  ถ้าไม่มีคณะนั้น ให้แสดงว่า "Sorry, you aren’t studying there."
name = input("ชื่อคณะ : ")
print("You are studying at KU Sriracha campus." if name in Faculty else "Sorry, you aren’t studying there.")

# %%
# 1. สร้าง Dictionary ที่มีชื่อว่า "FoodPrice" ที่มีรายการอาหารดังต่อไปนี้
# {"ต้มยำกุ้ง" : 90, "แกงส้ม" : 60, "ต้มข่าไก่" : 60, "ขนมจีนน้ำยา" : 40, "แกงเขียวหวานไก่" : 40, "มัสมั่นไก่" : 50, "แพนงหมู" : 40, "แกงจืดหมูสับ" : 30}
FoodPrice = {
    "ต้มยำกุ้ง" : 90, 
    "แกงส้ม" : 60, 
    "ต้มข่าไก่" : 60, 
    "ขนมจีนน้ำยา" : 40, 
    "แกงเขียวหวานไก่" : 40, 
    "มัสมั่นไก่" : 50, 
    "แพนงหมู" : 40, 
    "แกงจืดหมูสับ" : 30
}

# %%
# 2. เขียนโปรแกรมรับชื่ออาหารที่ต้องการค้นหาว่า -ชื่ออาหารนั้นหรือไม่ 
#    - ถ้ามีข้อความ ให้แสดงว่า "ชื่ออาหาร มีราคาเท่ากับ xxx บาท"
#    - ถ้าไม่มีข้อความ ให้แสดงว่า "เสียใจ ไม่มีอาหารที่คุณต้องการ"
food = input('ชื่ออาหาร : ')
print(f"{food} มีราคาเท่ากับ {FoodPrice[food]} บาท" if food in FoodPrice.keys() else "เสียใจ ไม่มีอาหารที่คุณต้องการ")

# %%
# 3. เขียนโปรแกรมเพิ่มรายการอาหารเพิ่มเติมได้โดยการรับชื่ออาหารและราคาอาหาร พร้อมแสดงจำนวนและรายการอาหารและราคาที่มีทั้งหมด
key = input('ชื่ออาหาร : ')
val = int(input('ราคา : '))
FoodPrice[key] = val
print(f'จำนวนรายการอาหารทั้งหมด {len(FoodPrice)}')
for k in FoodPrice:
    print(f'- {k} ราคา {FoodPrice[k]} บาท')

# %%
# 4. เขียนโปรแกรมลบรายการอาหารที่ต้องการลบ โดยให้แสดงรายการอาหารก่อน แล้วให้เลือกหมายเลขรายการอาหารที่ต้องการลบ พร้อมแสดงรายการอาหารที่ลบแล้ว
li = list(FoodPrice)
for i in range(li.__len__()):
    print(f'{i + 1}. {li[i]}')
num = int(input('โปรดเลือกหมายเลขรายการอาหารที่ต้องการลบ : '))
del FoodPrice[str(li[num - 1])]
print('รายการที่ลบแล้ว : ' , *FoodPrice , sep=' , ')

# %%
# 7. สร้าง Set ที่มีชื่อว่า “KUSRC” ที่มีรายการคณะในวิทยาเขตศรีราชา ได้แก่ {"Management", "Engineering", "Science", "Marine", "Economics"}  และสร้าง Set ที่มีชื่อว่า “KUBKK” ที่มีรายการคณะในวิทยาเขตบางเขน ได้แก่ {"Agriculture", "Business", "Fisheries", "Humanities", "Science", "Engineering", "Education", "Economics"}
KUSRC = {"Management", "Engineering", "Science", "Marine", "Economics"}
KUBKK = {"Agriculture", "Business", "Fisheries", "Humanities", "Science", "Engineering", "Education", "Economics"}

# %%
# 8. เขียนโปรแกรมแสดงรายการคณะตามเงื่อนไขที่ดังต่อไปนี้
# 7.1 รายการคณะทั้งหมดของทั้งสองวิทยาเขต
# 7.2 รายการคณะที่มีอยู่ในสองวิทยาเขต
# 7.3 รายการคณะที่มีอยู่ในวิทยาเขตศรีราชา แต่ไม่มีในวิทยาเขตบางเขน
print(KUSRC.union(KUBKK))
print(KUSRC.intersection(KUBKK))
print(KUSRC.difference(KUBKK))

# %%
# 9. เขียนโปรแกรมค้นหาชื่อคณะที่ต้องการว่า ชื่อคณะนั้นหรือไม่
#    - ถ้ามีคณะนั้นในวิทยาเขตบางเขน ให้แสดงว่า "คุณเรียนที่วิทยาเขตบางเขน"
#    - ถ้ามีคณะนั้นในวิทยาเขตศรีราชา ให้แสดงว่า "คุณเรียนที่วิทยาเขตศรีราชา"
#    - ถ้ามีคณะนั้นในวิทยาเขตศรีราชาและบางเขน ให้แสดงว่า "คุณมีโอกาสได้ทั้งสองวิทยาเขต"
#   -  ถ้าไม่มีคณะนั้น ให้แสดงว่า "เสียใจด้วย คุณไม่ได้เรียนที่วิทยาเขตบางเขนหรือศรีราชา"
facultyName = input('ค้นหาชื่อคณะ : ')
msg = ''
if facultyName in KUSRC and facultyName in KUBKK: msg = "คุณมีโอกาสได้ทั้งสองวิทยาเขต"
elif facultyName in KUBKK: msg = "คุณเรียนที่วิทยาเขตบางเขน"
elif facultyName in KUSRC: msg = "คุณเรียนที่วิทยาเขตศรีราชา"
else: msg = "เสียใจด้วย คุณไม่ได้เรียนที่วิทยาเขตบางเขนหรือศรีราชา"
print(msg)


