# %% [markdown]
# <h1 style="text-align: center;">บทที่ 3 VARIABLE</h1>
# <hr>

# %%
# ข้อ 1
# name = 'ชื่อของคุณ'
"ได้"

# %%
# ข้อ 2
# _name = 'ชื่อของคุณ'
"ได้"

# %%
# ข้อ 3
# name1 = 'ชื่อของคุณ'
"ได้"

# %%
# ข้อ 4
# name! = 'ชื่อของคุณ'
"ไม่ได้"

# %%
# ข้อ 5
# !name = 'ชื่อของคุณ'
"ไม่ได้"

# %%
# ข้อ 6
# number = 20
"ได้"

# %%
# ข้อ 7
# _number = 20
"ได้"

# %%
# ข้อ 8
# @number = 20
"ไม่ได้"

# %%
# ข้อ 9
# number@ = 20
"ไม่ได้"

# %%
# ข้อ 10
# a5 = 20
"ได้"

# %%
# ข้อ 11
# 5a = 20
"ไม่ได้"

# %%
# ข้อ 12
# favorite_food = 'Hamburger'
"ได้"

# %%
# ข้อ 13
# FavoriteFood = 'Hamberger' 
"ได้"

# %%
# ข้อ 14
# favorite food = 'Hamberger'
"ไม่ได้"

# %%
# ข้อ 15
# if = 7
"ไม่ได้"

# %%
# ข้อ 16
# else = 5
"ไม่ได้"

# %%
# ข้อ 17
# for = 6
"ไม่ได้"

# %%
# ข้อ 18
# a = 5 , b = 6 , c = 7
"ไม่ได้"

# %%
# ข้อ 19
# a , b , c = 5 , 6 ,7
"ไม่ได้"

# %%
# ข้อ 20
# a = 5; b = 6; c = 7
"ได้"


